Repository: teanet/Nazabore
Catalog: Nazabore/*.lproj/Localizable.strings
Languages: ru

# button_cancel_title
source: Cancel
ru: Отмена

# date_few_minutes_ago %ld
source: %ld minutes ago
ru: %ld минуты назад

# date_few_seconds_ago
source: Few seconds ago
ru: Несколько секунд назад

# date_several_minutes_ago %ld
source: %ld minutes ago
ru: %ld минут назад

# emoji_picker_any_emoji_button_title
source: Get any!
ru: Давай любую

# emoji_picker_description
source: It will be showed on the map and near the message soon
ru: Она отобразится на карте

# emoji_picker_title
source: Choose emoji
ru: Выберите приколюшку

# error_alert_title
source: Error
ru: Ошибка

# input_button_title
source: Write
ru: Написать

# input_text_placeholder
source: Something...
ru: Чё-нибудь...

# map_no_boards_message
source: It seems nobody has wrote here 😥. You can be the first!
ru: Похоже здесь ещё никто ничего не написал 😥. Вы можете стать первым!

# message_cell_my_message_text
source: My message
ru: Моё сообщение
